<?php

/**
 * Title: Слайдер (3 слайда)
 * Slug: tours/three-slides-slider
 * Categories: featured, banner
 * Description: Слайдер - 3 слайда
 */
?>
<!-- wp:group {"align":"full", "className":"slider-section"} -->
<div class="wp-block-group alignfull slider-section">


    <!-- wp:group {"className":"fixed-container"} -->
    <div class="wp-block-group fixed-container">
        <!-- wp:heading {"level":2} -->
        <h2>Заголовок секции</h2>
        <!-- /wp:heading -->

        <!-- wp:paragraph -->
        <p>Это основной текст секции внутри контейнера.</p>
        <!-- /wp:paragraph -->

        <!-- wp:columns {"className":"three-slides-slider swiper"} -->
        <div class="wp-block-columns three-slides-slider swiper">
            <!-- wp:column {"className":"swiper-wrapper"} -->
            <div class="wp-block-column swiper-wrapper">

                <!-- wp:group {"className":"three-slides-slider__slide swiper-slide"} -->
                <div class="wp-block-group three-slides-slider__slide swiper-slide">

                    <!-- wp:image {"url":"https://via.placeholder.com/300x200","alt":"слайд","className":"three-slides-slider__slide__image"} -->
                    <figure class="wp-block-image three-slides-slider__slide__image"><img src="<?php echo get_stylesheet_directory_uri() ?>/images/svg/placeholder.svg" alt="слайд" /></figure>
                    <!-- /wp:image -->

                    <!-- wp:group {"className":"wp-block-group three-slides-slider__slide__content"} -->
                    <div class="wp-block-group three-slides-slider__slide__content">

                    </div>
                    <!-- /wp:group -->
                </div>
                <!-- /wp:group -->
            </div>
            <!-- /wp:column -->

            <!-- wp:html -->
            <div class="sliders-controls">
                <div class="slider__button-prev">
                    <svg width="51" height="51" viewBox="0 0 51 51" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M0.71875 25.5C0.71875 11.8143 11.8143 0.71875 25.5 0.71875C39.1857 0.71875 50.2812 11.8143 50.2812 25.5C50.2812 39.1857 39.1857 50.2812 25.5 50.2812C11.8143 50.2812 0.71875 39.1857 0.71875 25.5ZM26.054 36.3847C26.2318 36.2084 26.3731 35.9988 26.4698 35.7678C26.5665 35.5369 26.6169 35.2892 26.6179 35.0388C26.6188 34.7885 26.5705 34.5403 26.4756 34.3087C26.3807 34.077 26.2411 33.8663 26.0647 33.6885L19.8313 27.4062H35.7461C36.2517 27.4062 36.7365 27.2054 37.094 26.8479C37.4515 26.4904 37.6523 26.0056 37.6523 25.5C37.6523 24.9944 37.4515 24.5096 37.094 24.1521C36.7365 23.7946 36.2517 23.5938 35.7461 23.5938H19.8313L26.0647 17.3115C26.2411 17.1336 26.3806 16.9227 26.4754 16.6909C26.5703 16.459 26.6185 16.2108 26.6174 15.9603C26.6163 15.7099 26.5659 15.4621 26.469 15.2311C26.3721 15.0001 26.2307 14.7904 26.0528 14.6141C25.8749 14.4378 25.664 14.2982 25.4322 14.2034C25.2004 14.1086 24.9521 14.0603 24.7017 14.0614C24.1958 14.0637 23.7116 14.2668 23.3555 14.626L13.8969 24.1573C13.5426 24.5143 13.3438 24.997 13.3438 25.5C13.3438 26.003 13.5426 26.4857 13.8969 26.8427L23.3555 36.374C23.5318 36.5521 23.7416 36.6937 23.9727 36.7906C24.2039 36.8876 24.4519 36.938 24.7025 36.939C24.9532 36.94 25.2016 36.8916 25.4335 36.7964C25.6654 36.7013 25.8762 36.5614 26.054 36.3847Z" fill="#25CCD8" />
                    </svg>
                </div>
                <div class="slider-pagination swiper-pagination"></div>
                <div class="slider__button-next">
                    <svg width="51" height="51" viewBox="0 0 51 51" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path d="M50.2812 25.5C50.2812 11.8143 39.1857 0.71875 25.5 0.71875C11.8143 0.71875 0.71875 11.8143 0.71875 25.5C0.71875 39.1857 11.8143 50.2812 25.5 50.2812C39.1857 50.2812 50.2812 39.1857 50.2812 25.5ZM24.946 36.3847C24.7682 36.2084 24.6269 35.9988 24.5302 35.7678C24.4335 35.5369 24.3831 35.2892 24.3821 35.0388C24.3812 34.7885 24.4295 34.5403 24.5244 34.3087C24.6193 34.077 24.7589 33.8663 24.9353 33.6885L31.1687 27.4062H15.2539C14.7483 27.4062 14.2635 27.2054 13.906 26.8479C13.5485 26.4904 13.3477 26.0056 13.3477 25.5C13.3477 24.9944 13.5485 24.5096 13.906 24.1521C14.2635 23.7946 14.7483 23.5938 15.2539 23.5938H31.1687L24.9353 17.3115C24.7589 17.1336 24.6194 16.9227 24.5246 16.6909C24.4297 16.459 24.3815 16.2108 24.3826 15.9603C24.3837 15.7099 24.4341 15.4621 24.531 15.2311C24.6279 15.0001 24.7693 14.7904 24.9472 14.6141C25.1251 14.4378 25.336 14.2982 25.5678 14.2034C25.7996 14.1086 26.0479 14.0603 26.2983 14.0614C26.8042 14.0637 27.2884 14.2668 27.6445 14.626L37.1031 24.1573C37.4574 24.5143 37.6562 24.997 37.6562 25.5C37.6562 26.003 37.4574 26.4857 37.1031 26.8427L27.6445 36.374C27.4682 36.5521 27.2584 36.6937 27.0273 36.7906C26.7961 36.8876 26.5481 36.938 26.2975 36.939C26.0468 36.94 25.7984 36.8916 25.5665 36.7964C25.3346 36.7013 25.1238 36.5614 24.946 36.3847Z" fill="#25CCD8" />
                    </svg>
                </div>
            </div>
            <!-- /wp:html -->
        </div>
        <!-- /wp:columns -->




    </div>
    <!-- /wp:group -->

</div>
<!-- /wp:group -->